Repository: Gubchik123/PostGubchikBot
Catalog: bot/locales/*/LC_MESSAGES/easypostbot.po
Languages: ru

source: Choose subscription to change:
ru: Выберите подписку для изменения:

source: Enter new subscription price (current price is {price} {currency_symbol})
ru: Введите новую цену подписки (текущая цена {price} {currency_symbol})

source: Subscription price has been changed from {previous_price} to {new_price}!
ru: Цена подписки изменена с {previous_price} на {new_price}!

source: 👥 <b>Referral statistics</b> You balance: <b>{balance} {currency_symbol}</b> Referrals: <b>{referrals}</b> Your referral link: <code>{referral_link}</code> Invite your friends to the botand get <b>{referral_bonus} {currency_symbol}</b> for each referral.
ru: 👥 <b>Реферальная статистика</b> Ваш баланс: <b>{balance} {currency_symbol}</b> Рефералы: <b>{referrals}</b> Ваша реферальная ссылка: <code>{referral_link}</code> Приглашайте друзей в бота и получайте <b>{referral_bonus} {currency_symbol}</b> за каждого реферала.

source: ☺️ <b>Subscription</b> You have <b>{subscription_text}</b> subscription. You can add up to <b>{max_channels}</b> channels. Your subscription will expire on <b>{expire_date}</b>.
ru: ☺️ <b>Подписка</b> У вас <b>{subscription_text}</b> подписка. Вы можете добавить до <b>{max_channels}</b> каналов. Ваша подписка истекает <b>{expire_date}</b>.

source: {subscription_text} <i>Maximum channels: {max_channels}</i>
ru: {subscription_text} <i>Максимальное количество каналов: {max_channels}</i>

source: ☺️ <b>Subscription</b> You can add up to {DEFAULT_max_free_channels} channels to the bot <b>for free</b>. {subscriptions_text}<i>* All subscriptions for {default_subscription_days} days</i>
ru: ☺️ <b>Подписка</b> Вы можете добавить до {DEFAULT_max_free_channels} каналов в бот <b>бесплатно</b>. {subscriptions_text}<i>* Все подписки на {default_subscription_days} дней</i>

source: Test payment!
ru: Тестовый платеж!

source: Bot subscription
ru: Подписка на бота

source: Bot subscription for {default_subscription_days} days
ru: Подписка на бота на {default_subscription_days} дней

source: Subscription for {default_subscription_days} days
ru: Подписка на {default_subscription_days} дней

source: We have successfully charged <b>{total_amount} {currency}</b> from your balance! <b>Subscription for {default_subscription_days} days is activated!</b>
ru: Мы успешно списали <b>{total_amount} {currency}</b> с вашего баланса! <b>Подписка на {default_subscription_days} дней активирована!</b>

source: Processing...
ru: Обработка...

source: Payment for <b>{total_amount} {currency}</b> is successful! <b>Subscription for {default_subscription_days} days is activated!</b>
ru: Оплата <b>{total_amount} {currency}</b> прошла успешно! <b>Подписка на {default_subscription_days} дней активирована!</b>

source: <b>Changing timezone.</b> Your current timezone: <i>{timezone}</i>. You can choose a new time zone by choosing from the options below.
ru: <b>Изменение часового пояса.</b> Ваш текущий часовой пояс: <i>{timezone}</i>. Вы можете выбрать новый часовой пояс, выбрав один из вариантов ниже.

source: Choose a city in {country}:
ru: Выберите город в {country}:

source: Timezone successfully changed to {timezone}!
ru: Часовой пояс успешно изменен на {timezone}!

source: You have reached the limit of channels!
ru: Вы достигли лимита каналов!

source: Forward a message here from the channel you want to add. <b>Important:</b> the bot and you must be administratorsin the channel from which you are forwarding the message.
ru: Перешлите сюда сообщение из канала, который хотите добавить. <b>Важно:</b> бот и вы должны быть администраторами в канале, из которого вы пересылаете сообщение.

source: Choose channel to remove:
ru: Выберите канал, который хотите удалить:

source: Are you sure you want to remove the '{channel_title}'?
ru: Вы уверены, что хотите удалить '{channel_title}'?

source: Channel '{}' removed.
ru: Канал '{}' удален.

source: Available commands: /start - Start working with the bot /help - Send of basic usage rules /language - Change the language of the bot /menu - Send main menu
ru: Доступные команды: /start - Начало работы з ботом /help - Отображение основных правил использования /language - Изменения языка бота /menu - Отправить главное меню

source: Hello, {name}!
ru: Привет, {name}!

source: Your channels: {channel_list_items} Choose one of the buttons below:
ru: Ваши каналы: {channel_list_items} Выберите одну из кнопок ниже:

source: You currently have no channels. Choose one of the buttons below:
ru: У вас пока нет каналов. Выберите одну из кнопок ниже:

source: Cancel
ru: Отмена

source: Next
ru: Далее

source: You can't add animation into this album!
ru: Вы не можете добавить анимацию в этот альбом!

source: You can't add document into this album!
ru: Вы не можете добавить документ в этот альбом!

source: You can't add audio into this album!
ru: Вы не можете добавить аудио в этот альбом!

source: You can't add photo into this album!
ru: Вы не можете добавить фото в этот альбом!

source: You can't add video into this album!
ru: Вы не можете добавить видео в этот альбом!

source: Select the channel(s) you want to post to:
ru: Выберите канал(ы), в который(ые) хотите опубликовать пост:

source: Send me group name:
ru: Отправьте мне название группы:

source: You selected the {selected_channels} channel(s) to create a post Send me post content (text, photo, video, gif...)
ru: Вы выбрали {selected_channels} канал(ы) для создания поста Отправьте мне контент поста (текст, фото, видео, gif...)

source: You selected the {selected_channels} channel(s) to create posts in queue Send posts that should be added to the queue. <b>Once finished, click the 'Next' button to save your posts.</b> <i>When adding a large number of posts, wait until all the media files are loaded and only then click the 'Next' button.</i>
ru: Вы выбрали {selected_channels} канал(ы) для создания постов в очереди Отправьте посты, которые должны быть добавлены в очередь. <b>После завершения нажмите кнопку 'Далее', чтобы сохранить ваши посты.</b> <i>При добавлении большого количества постов, дождитесь загрузки всех медиа-файлов и только после этого нажимайте кнопку 'Далее'.</i>

source: You selected the {selected_channels} channel(s) to create a post Send me post album (animation, document, audio, photo and video) <b>Important: album must contain content of the same type (e.g. only photos)</b>
ru: Вы выбрали {selected_channels} канал(ы) для создания поста Отправьте мне альбом поста (анимация, документ, аудио, фото и видео) <b>Важно: альбом должен содержать контент одного типа (например, только фото)</b>

source: Content is added ✅
ru: Контент добавлен ✅

source: URL buttons are added ✅ You can continue sending post content.
ru: URL-кнопки добавлены ✅ Вы можете продолжить отправку контента поста.

source: Content is removed ❌
ru: Контент удален ❌

source: You don't have any scheduled posts yet :(
ru: У вас еще нет запланированных постов :(

source: Select a post to edit it:
ru: Выберите пост, который хотите отредактировать:

source: Scheduled post #{post_id} Publication time: {run_date} You can choose an action for this post:
ru: Отложенный пост #{post_id} Время публикации: {run_date} Вы можете выбрать действие для этого поста:

source: Are you sure you want to publish this post (#{post_id}) now?
ru: Вы уверены, что хотите опубликовать этот пост (#{post_id}) сейчас?

source: Post #{post_id} has been published!
ru: Пост #{post_id} опубликован!

source: <b>Enter a new time for the scheduled post</b> Format example - 15.08.2023 13:40
ru: <b>Введите новое время для запланированного поста</b> Пример формата - 15.08.2023 13:40

source: 😌 The publication time of the post has been changed successfully! New publication time: {run_date}
ru: 😌 Время публикации поста успешно изменено! Новое время публикации: {run_date}

source: Are you sure you want to remove this post (#{post_id})?
ru: Вы уверены, что хотите удалить этот пост (#{post_id})?

source: Post #{post_id} has been removed!
ru: Пост #{post_id} удален!

source: Send me the time to publish the post <b>today</b>. Send date and time to schedule post publishing for any other day. Format example (today): 15.08.2023 13:40
ru: Отправьте мне время для публикации поста <b>сегодня</b>. Отправьте дату и время для планирования публикации поста на любой другой день. Пример формата (сегодня): 15.08.2023 13:40

source: Wrong date and (or) time format. Try again! Format example - 15.08.2023 13:40
ru: Неправильный формат даты и (или) времени. Попробуйте еще раз! Пример формата - 15.08.2023 13:40

source: 🚀 Post is scheduled! #{post_id} Selected channels: {selected_channels} Publication time: {date}
ru: 🚀 Пост запланирован! #{post_id} Выбранные каналы: {selected_channels} Время публикации: {date}

source: Post content is ready to publish into: {selected_channels} Do you want to publish it now or later?
ru: Контент поста готов к публикации в: {selected_channels} Вы хотите опубликовать его сейчас или позже?

source: Publishing...
ru: Публикация...

source: Published!
ru: Опубликовано!

source: You can set a self-destruct timer for the post. Select or send the number of hours after which you want to delete the post.
ru: Вы можете установить таймер самоуничтожения для поста. Выберите или отправьте количество часов, через которое вы хотите удалить пост.

source: Published! Post will be deleted in {hour} hours and {minute} minutes.
ru: Опубликовано! Пост будет удален через {hour} часов и {minute} минут.

source: Select what you want to add to all posts in the queue:
ru: Выберите, что вы хотите добавить ко всем постам в очереди:

source: Send me new caption for all posts in the queue.
ru: Отправьте мне новую подпись ко всем постам в очереди.

source: There are no images in the queue.
ru: В очереди нет изображений.

source: Pay attention that you can't edit watermark for posts in queue!
ru: Обратите внимание, что вы не сможете отредактировать водяной знак для постов в очереди!

source: Send me new watermark (image or text) for all images in the queue.
ru: Отправьте мне новый водяной знак (изображение или текст) для всех изображений в очереди.

source: Posts are already shuffled.
ru: Посты уже перемешаны.

source: Send the date from which to start posting messages in the format: DD.MM.YYYY (15.08.2023)
ru: Отправьте дату, с которой начать публикацию сообщений в формате: ДД.ММ.ГГГГ (15.08.2023)

source: Wrong date! Try again! Format example: 15.08.2023
ru: Неправильная дата! Попробуйте еще раз! Пример формата: 15.08.2023

source: Enter the time between which posts should be published (for example 09:20-21:20) Or send the time in this format: 12:00 12:40 15:00 <b>Date</b>: {date} <b>Channel(s)</b>: {channels}
ru: Введите время, между которым должны быть опубликованы посты (например 09:20-21:20) Или отправьте время в этом формате: 12:00 12:40 15:00 <b>Дата</b>: {date} <b>Канал(ы)</b>: {channels}

source: Wrong time! Try again! Format example: 09:20-21:20 Or send the time in this format: 12:00 12:40 15:00
ru: Неправильное время! Попробуйте еще раз! Пример формата: 09:20-21:20 Или отправьте время в этом формате: 12:00 12:40 15:00

source: Send the interval between posts in minutes (for example: 15) <b>Date</b>: {date} <b>Time</b>: {time} <b>Channel(s)</b>: {channels}
ru: Отправьте интервал между постами в минутах (например: 15) <b>Дата</b>: {date} <b>Время</b>: {time} <b>Канал(ы)</b>: {channels}

source: Wrong interval! Try again! Format example: 15
ru: Неправильный интервал! Попробуйте еще раз! Пример формата: 15

source: 🚀 {posts_count} posts are scheduled successfully! Channel(s): {channels} Publishing times: {publishing_times}
ru: 🚀 {posts_count} постов успешно запланировано! Канал(ы): {channels} Время публикации: {publishing_times}

source: Remove
ru: Удалить

source: ⭐️ Subscription
ru: ⭐️ Подписка

source: 👥 Referrals
ru: 👥 Рефералы

source: Add channel
ru: Добавить канал

source: Remove channel
ru: Удалить канал

source: Create post
ru: Создать пост

source: Posts in queue
ru: Посты в очереди

source: Change timezone
ru: Изменить часовой пояс

source: 🔙 Back
ru: 🔙 Назад

source: Start
ru: Старт

source: Pro
ru: Профи

source: Unlimited
ru: Безлим

source: Update subscription
ru: Обновить подписку

source: Pay for {price} {currency_symbol}
ru: Оплатить {price} {currency_symbol}

source: Charge from balance
ru: Списать с баланса

source: Add URL buttons
ru: Добавить URL-кнопки

source: Disable web page preview
ru: Отключить предпросмотр веб-страницы

source: Disable notification
ru: Отключить уведомление

source: Remove content
ru: Удалить контент

source: Publication time: {run_date} [{post_id}]
ru: Время публикации: {run_date} [{post_id}]

source: Publish now
ru: Опубликовать сейчас

source: Change publication time
ru: Изменить время публикации

source: Select all
ru: Выбрать все

source: Create group
ru: Создать группу

source: Scheduled posts
ru: Отложенные посты

source: Create an album
ru: Создать альбом

source: Publish but set a deletion timer
ru: Задать таймер удаления

source: Publish
ru: Опубликовать

source: Postpone
ru: Отложить

source: Add a caption
ru: Добавить подпись

source: Add watermark
ru: Добавить водяной знак

source: Shuffle posts
ru: Перемешать посты

source: Today
ru: Сегодня

source: Tomorrow
ru: Завтра

source: After tomorrow
ru: Послезавтра

source: Send me list of URL buttons in one message. Please, follow this format: Button text 1 - <code>https://example1.com</code> Button text 2 - <code>https://example2.com</code> Use separator '|' to add up to 3 buttons to one row. Example: Button text 1 - <code>https://example1.com</code> | Button text 2 - <code>https://example2.com</code> Button text 3 - <code>https://example3.com</code> | Button text 4 - <code>https://example4.com</code> Click the back button to cancel and return to content adding.
ru: Отправьте мне список URL-кнопок в одном сообщении. Пожалуйста, следуйте этому формату: Текст кнопки 1 - <code>https://example1.com</code> Текст кнопки 2 - <code>https://example2.com</code> Используйте разделитель '|' для добавления до 3 кнопок в одну строку. Пример: Текст кнопки 1 - <code>https://example1.com</code> | Текст кнопки 2 - <code>https://example2.com</code> Текст кнопки 3 - <code>https://example3.com</code> | Текст кнопки 4 - <code>https://example4.com</code> Нажмите кнопку '🔙 Back', чтобы отменить и вернуться к добавлению контента.
